---
kind: property
id: P:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.IsProductList
source: html/85c561ea-3683-e83d-5a3c-63a19e8e4f11.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.IsProductList Property

Are the sizes for a product listed fabrication part.

## Syntax (C#)
```csharp
public bool IsProductList { get; set; }
```